app/controllers/news_controller.rb

INSERT INTO "news" ("author", "body", "created_at", "image_url", "prew", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@news = News.new(params[:news])
    	if @news.save

SELECT "news".* FROM "news" ORDER BY created_at DESC
---
	def archive
		@all_news = News.all(:order => "created_at DESC")

SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "news" WHERE "news"."id" = ?  [["id", 5]]
---
	def edit
		@news = News.find(params[:news_id])
		@news.destroy

SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "news" WHERE "news"."id" = ?  [["id", 1]]
---
	def delete
		@news = News.find(params[:news_id])
		@news.destroy

SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", "14"]]
---
	def show
		@news = News.find(params[:news_id]);